mypass/src/InformationRegisters/ЖурналСобытий/ЖурналСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналСобытий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭкземплярДоступа</name>
    <type>
      <types>DocumentRef.ЭкземплярДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДанных</name>
    <type>
      <types>CatalogRef.ВидыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваВидовДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

mypass/src/InformationRegisters/ЖурналСобытий/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет запись события в регистр сведений.
//
// Параметры:
//  Событие					 - Структура - Структура полей записи регистра сведений.
//  ДополнительныеПараметры	 - Структура - Дополнительные параметры выполнения процедуры.
//
Процедура ЗаписатьСобытие(Событие, ДополнительныеПараметры = Неопределено) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Событие);
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

// Функция возвращает все поля события в виде структуры.
// 
// Параметры:
//  ДополнительныеПараметры - Структура - Дополнительные параметры выполнения функции.
// 
// Возвращаемое значение:
//  Структура - Структура полей.
//@skip-check constructor-function-return-section
Функция СтруктураСобытия(ДополнительныеПараметры = Неопределено) Экспорт
	
	СтруктураПолейСобытия = Новый Структура;
	
	СтруктураПолейСобытия.Вставить("ТипСобытия");
	СтруктураПолейСобытия.Вставить("ЭкземплярДоступа");
	СтруктураПолейСобытия.Вставить("ВидДанных");
	СтруктураПолейСобытия.Вставить("Свойство");
	
	Возврат СтруктураПолейСобытия;
	
КонецФункции

#КонецОбласти

#КонецЕсли
